var chs_blk=new Uint32Array([173,994,1566,2260,4096,4306,5120,7675,8452,8592,9312,11361,12032,12832,13056,19904,40960,42192,42560,42775,44032,57344,64467,65142,65281,])
var chl_blk=new Uint32Array([5,2,1,1,1,2,5,2,1,4,14,1,1,1,53,164,9,2,1,1,87,52,2,1,1,])
var chi_blk=0
var chs_edge=new Uint32Array([813,1250,1329,1369,1377,1417,1421,1425,1488,1521,1536,1694,1807,1869,1984,2048,2096,2112,2142,2208,2230,2388,2437,2447,2451,2475,2487,2492,2503,2507,2519,2524,2527,2535,2561,2565,2575,2579,2602,2610,2613,2616,2620,2622,2631,2635,2641,2649,2654,2662,2689,2693,2703,2707,2730,2738,2741,2748,2759,2763,2768,2784,2790,2809,2817,2821,2831,2835,2858,2866,2869,2876,2887,2891,2902,2908,2911,2918,2946,2949,2958,2962,2969,2972,2974,2979,2984,2990,3006,3014,3018,3024,3031,3047,3072,3077,3086,3090,3114,3133,3142,3146,3157,3160,3168,3174,3192,3205,3214,3218,3242,3253,3260,3270,3274,3285,3294,3296,3302,3313,3329,3333,3342,3346,3389,3398,3402,3412,3430,3458,3461,3482,3507,3517,3520,3530,3535,3542,3544,3558,3570,3585,3648,3713,3716,3720,3722,3725,3732,3737,3745,3749,3751,3754,3757,3771,3776,3782,3784,3792,3804,3840,3913,3953,3993,4030,4046,4224,4295,4301,4562,4682,4688,4696,4698,4705,4746,4752,4786,4792,4800,4802,4808,4825,4882,4889,4957,4992,5024,5112,5760,5792,5888,5902,5935,5952,5984,5998,6002,6016,6112,6128,6144,6160,6176,6272,6320,6400,6432,6448,6464,6468,6512,6528,6576,6608,6622,6686,6752,6783,6800,6816,6832,6912,6993,7040,7164,7227,7245,7360,7376,7416,7616,7931,8193,8294,8352,8400,8580,9104,9253,9280,11104,11126,11160,11197,11210,11244,11264,11313,11489,11513,11559,11568,11632,11647,11680,11688,11696,11704,11712,11720,11728,11736,11744,11909,11931,12160,12272,12288,12353,12441,12593,12784,12960,19840,40896,42112,42128,42448,42688,42903,42999,43056,43072,43136,43214,43232,43264,43359,43392,43471,43486,43520,43584,43600,43612,43739,43777,43785,43793,43808,43816,43825,43888,44016,55168,64000,64256,64275,64285,64312,64318,64320,64323,64326,64723,64848,64914,65008,65024,65056,65122,65136,65270,65279,65409,65474,65482,65490,65498,65504,65529,])
var chl_edge=new Uint32Array([75,78,38,7,39,2,3,55,27,4,29,112,60,101,59,46,15,28,1,21,8,48,8,2,22,6,3,9,2,4,1,2,5,21,3,6,2,22,7,2,2,2,1,5,2,3,1,4,1,16,3,9,3,22,7,2,5,10,3,3,1,4,12,1,3,8,2,22,7,2,5,9,2,3,2,2,5,18,2,6,3,4,2,1,2,2,3,12,5,3,4,1,1,20,4,8,3,23,16,8,3,4,2,3,4,10,12,8,3,23,10,5,9,3,4,2,1,4,10,2,3,8,3,41,8,3,6,16,26,2,18,24,9,1,7,1,6,1,8,10,3,58,28,2,1,1,1,1,4,7,3,1,1,2,13,3,5,1,6,10,4,72,36,39,36,15,13,70,1,1,119,4,7,1,4,40,4,33,4,7,1,4,15,56,4,66,32,26,86,6,29,89,13,7,8,20,13,3,2,94,10,10,15,10,88,43,70,31,12,12,1,42,5,44,26,11,62,65,29,11,10,14,15,76,44,116,60,15,60,8,39,2,54,27,100,12,31,33,8,111,2,11,20,32,34,12,8,4,47,46,19,45,1,56,1,24,7,7,7,7,7,7,7,7,101,21,89,86,12,64,86,103,94,47,95,54,22,13,55,92,56,24,53,10,56,70,12,30,84,30,78,11,33,55,14,10,103,28,6,6,6,7,7,53,126,10,36,110,7,5,26,5,1,2,2,124,109,64,54,14,26,51,5,5,7,1,62,6,6,6,3,7,5,])
var chi_edge=0
var table = {}; // precomputed
table[8] = '0123456789¡¢£¤¥¦§¨©ª«¬®¯°±²³´µ¶·¸¹º»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö÷øùúûüýþÿĀāĂăĄąĆćĈĉĊċČčĎďĐđĒēĔĕĖėĘęĚěĜĝĞğ !"#$%&\'()*+,-./:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxyz{|}~ͰͱͲͳʹ͵Ͷͷͺͻͼͽ;Ϳ΄΅Ά·ΈΉΊΌΣΤΥΦΧΨΩΪΫάέήίΰαβγδεζηθικλμνξοπρςστυφχψωϊϋόύώϏϐϑϒϓϔϕϖϗϘϙϚϛϜϝϞϟϠϡϰϱϲϳϴϵ϶ϷϸϹϺϻϼϽϾϿЀЁЂЃЄЅІЇЈЉЊЋЌЍЎЏАБВГДЕЖЗИЙКЛМНОПРСТΎΏΐΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡԣԤԥԦԧԨԩԮԯءؤةرزهوڑڒړڔږڗژڙ՟गदपबमवषहէշაბევზიკმნპჟსუქყშჩძწჭხჰჱჲჳჴჸჺ჻ᐜᑉכװۆۇۈۋە܅܆܇ܕܖܝܪܯᴀᴁᴂᴃᴄᴅᴆᴇᴈᴉᴊᴋᴌᴍᴎᴏᴐᴑᴒᴓᴔᴕᴖᴗᴘᴙᴚᴛᴜᴝᴞᴟᴠᴡᴢᴣᴤᴥᴦᴧᴨᴩᴪᴫᴬᴭᴮᴯᴰᴱᴲᴳᴴᴵᴶᴷᴸᴹᴺᴻᴼᴽᴾᴿᵀᵁᵂᵃᵄᵅᵆᵇᵈᵉᵊᵋᵌᵍᵎᵏᵐᵑᵒᵓᵔᵕᵖᵗᵘᵙᵚᵛᵜᵝᵞᵟᵠᵡᵢᵣᵤᵥᵦᵧᵨᵩᵪᵫᵬᵭᵮᵯᵰᵱᵲᵳᵴᵵᵶᵷᵸᵹᵺᵻᵼᵽᵾᵿݥݦݿށބވމފތލގޒޔޗޛޡޢޥḀḁḂḃḄḅḆḇḈḉḊḋḌḍḎḏḐḑḒḓḔḕḖḗḘḙḚḛḜḝḞḟḠḡḢḣḤḥḦḧḨḩḪḫḬḭḮḯḰḱḲḳḴḵḶḷḸḹḺḻḼḽḾḿṀṁṂṃṄṅṆṇṈṉṊṋṌṍṎṏṐṑṒṓṔṕṖṗṘṙṚṛṜṝṞṟṠṡṢṣṤṥṦṧṨṩṪṫṬṭṮṯṰṱṲṳṴṵṶṷṸṹṺߙߞߠߣߤߥ℀℁ℂ℃℅℆ℇ℈℉ℍℎℏℓℕ№℗ℙℚℝ℠℡™ℤΩ℧℩KÅ℮Ⅎℴℵℶℹ℻ℼℽℾℿ⅁⅂⅃⅄ⅅⅆⅇⅈⅉ⅋⅍ⅎ⅐⅑⅒⅓⅔⅕⅖⅗⅘⅙⅚⅛⅜⅝⅞ⅠⅡⅢⅣⅤⅥⅦⅧⅨⅩⅪⅫⅬⅭⅮⅯⅰⅱⅲⅳⅴⅵⅶⅷⅸⅹⅺⅻⅼⅽⅾⅿ࠻∀∁∂∃∄∅∆∇∈∉∊∋∌∍∎ࡂࡘग़ॿইঌগঙছথপলশসৡ০২৩৪৫৬৭৮৯৵ⱠⱢⱣⱤⱥⱦⱧⱨⱩⱪⱫⱬⱭⱮⱯⱰⱱⱲⱳⱴⱵⱶⱷⱹⱻⱼⱽⱾⱿⲁⲏⲑⲗⲛⲟⲡⲢⲩⲯⲳⲹⲻⳅⳊⳍⳐⳗⳟ੬ઢરઽ૧୧୨୮୯உப௦క౺ขจชถยฤลวสอฮ฿แ๐๑๖ງໄ༈༡༢༣༦༨༩࿅࿈ሃሄበባቦቨቫቮቯኒኔዕዘዛዞዩጎጘጞፅ፥፦᎑᎔ᎨᎮᎰᎼᏐᏓᏗ ᚁᚆᚋᚐᚕ᚛᚜ᛱᛶᛷᜠᜡᜢᜣᜤᜥᜦᜧᜨᜩᜪᜫᜬᜭᜮᜰᜱ៖ᠵᠶᡏᡛᡪᡲᡷᢃᢄᢌᢏᢞᢣᢦᢾᢿᣃᣄᣔᣛᤚ᥅᥇᥈᥊᥋᥌᥍᥎᥏ᥠᥤᥥᥦᥩᥪᥫᥳ᧒᧙᨟ᩡ᪒᭐᭔᭢᭤᯿ᰚᰛᰬᰭᰮᰯᰰᰱᰲᰳᰶ᰷᰽᱀᱁᱇᱉᱑᱒᱓᱔᱖᱗ᱻᳱᳲᳵᶀᶁᶂᶃᶄᶅᶆᶇᶈᶉᶊᶋᶌᶍᶎᶏᶐᶑᶒᶓᶔᶕᶖᶗᶘᶙᶚᶛᶜᶝᶞᶟᶠᶡᶢᶣᶤᶥᶦᶧᶨᶩᶪᶫᶬᶭᶮᶯᶰᶱᶲᶳᶴᶵᶶᶷᶸᶹᶺᶻᶼᶽᶾᶿỻỼỽỾỿἀἁἂἃἄἅἆἇἈἉἊἋἌἍἎἏἐἑἒἓἔἕἘἙἚἛἜἝἠἡἢἣἤἥἦἧἨἩἪἫἬἭἮἯἰἱἲἳἴἵἶἷἸἹἺἻἼἽἾἿὀὁὂὃὄὅὈὉὊὋὌὍὐὑὒὓὔὕὖὗὙὛὝὟὠὡὢὣὤὥὦὧὨὩὪὫὬὭὮὯὰάὲέὴήὶίὸόὺύὼώᾀᾁᾂᾃᾄᾅᾆᾇᾈᾉᾊᾋᾌᾍᾎᾏᾐᾑᾒᾓᾔᾕᾖᾗᾘᾙᾚᾛᾜᾝᾞᾟᾠᾡᾢᾣᾤᾥᾦᾧᾨᾩᾪᾫᾬᾭᾮᾯᾰᾱᾲᾳᾴᾶᾷᾸᾹᾺΆᾼ᾽ι᾿῀῁ῂῃῄῆῇῈΈῊΉῌ῍῎῏ῐῑῒΐῖῗῘῙῚΊ῝῞῟ῠῡῢΰῤῥῦῧῨῩῪΎῬ῭΅`ῲῳῴῶῷῸΌῺΏῼ´῾‐‑‒–‖‗‘’‚‛“”„‟†‡•‣‧′″‴‵‶‷‸‹›‼‽‾‿⁀⁁⁃⁄⁅⁆⁇⁈⁉⁊⁋⁌⁍⁎⁏⁐⁑⁒⁔⁕⁖⁗⁘⁙⁚⁛⁜⁝⁞⁰ⁱ⁴⁵⁶⁷⁸⁹⁺⁻⁼⁽⁾ⁿ₀₁₂₃₄₅₆₇₈₉₊₋₌₍₎ₐₑₒₓₔₕₖₗₘₙₚₛₜ₣₤₥₦₧₨₩₫€₭₮₯₴₸₹₽ꀈꀞꀦꀧꀨꀭꀮꀯꁊꁦꁧꁳꁴꁵꁼↀↁↂↃↄↅↆↇↈ↉↊↋⎕⎛⎜⎝⎞⎟⎠⎡⎢⎣⎤⎥⎦⎧⎨⎩⎪⎫⎬⎭⎮⎰⎱␀␁␂␃␄␅␆␇␈␉␊␋␌␍␎␏␐␑␒␓␔␕␖␗␘␙␚␛␜␝␞␟␠␡␢␣␤␦ꓙꓩꔷꙁꙃꙄꙅꙋꙌꙍꙖꙗꚃꚊꚋꚍꚑꚘꚙꚜꚝꚳꚹⰓ꜀꜁꜂꜃꜄꜅꜆꜇꜈꜉꜊꜋꜌꜍꜎꜏꜐꜑꜒꜓꜔꜕꜖ꜛꜜꜝꜞꜟꜢꜣꜤꜥꜦꜧꜰꜱꜲꜳꜴꜵꜾꜿꝀꝁꝈꝊꝋꝎꝏꝚꝛꝟꝣꝤꝥꝦꝧꝩꝫꝬꝭꝵꝸꝻꝽꝾꝿⰰⰳⰵⰷⱈⱍⱏⱔⱖⱛ⳥⳦ⴭⴾⵆⵊⵯ⸀⸁⸂⸃⸄⸅⸆⸇⸈⸉⸊⸋⸌⸍⸘⸜⸝⸞⸟⸢⸣⸤⸥⸨⸩⸮ⸯ⸰⸱⸲⸳⸴⸵⸸⸹⹁⹂꒔꒗꒘꒞꒠꒣꒩꒯꒸꒹꒻꒼꒾꓃꓄ꗚ꘍꘎꘦꘨ꛌꛒꛕꛚꛦꛧꛨꛩꛪꛬ꛵ꞀꞁꞄꞇꞈ꞉ꞋꞌꞍꞎꞏꞐꞑꞒꞓꞔꞕꞘꞙꞩꞪꞫꞬꞭꞮꞰꞱꞲꞳꞴꞵꞶꞷꟸꟹꟺꟻꟼꠁꠑ꠷ꡊꡘꡦꡫ꣓꣔꣖꣙ꣲꣳꣴꣵꣶꣷꣻ꤮ꤰꤳꤴꤹ꧈ꪅꪶꪻꪼꬰꬵꬿꭉꭓꭗꭙ꭛ꭜꭞꭠꭡꭢꭣꭤꭥꭶꭻꭾꮀꮁꮓꮛꮞꮣꮪꮮꮷꮽꮾ꯫ﬁﬂכּכֿﭬﭭﭰﭱﮃﮅﮇﮉﮊﮌﮐﮔﮘﮜﮬﳙﾁﾂﾃﾄﾅﾆﾇﾈﾉﾊﾋﾌﾍﾎﾏﾐﾑﾒﾓﾔﾕﾖﾗﾘﾙﾚﾛﾜﾝﾞﾟ�ﯕﯗﯘﯙﯚﯛﯜﯞﯟﯪﺀﺅﺆﺓﺪﺬﺭﺯﻌﻏﻐﻓﻔﻗﻘﻛﻩﻫﻭﻮ｡｢｣､･ｦｧｨｩｪｫｬｭｮｯｰｱｲｳｴｵｶｷｸｹｺｻｼｽｾｿﾀ';
var ctx = document.createElement("canvas").getContext("2d");
ctx.font = "400 16px Iosevka Fuck Web";
function text_size(text) {
	return ctx.measureText(text).width;
}
var lst = Array.from(document.getElementsByClassName("cens"));
for (var i = 0; i < lst.length; ++i) {
	var e = lst[i];
	e.style.display = "inline-block";
	e.style.height = "1.25em"
	e.style.marginBottom = "-0.3125em";
	e.style.width = ctx.measureText(e.innerText).width + "px";
	e.style.overflow = "hidden";
	e.className = "cens-js";
	lst[i] = [e, e.innerText];
}
function gen(i, l) {
	l += i;
	for (; i < l; ++i) {
		var c = String.fromCodePoint(i);
		var n = text_size(c);
		if (n !== 8)
			table[n] = (table[n] || "") + c;
	}
}
function frame() {
	requestAnimationFrame(frame);
	if (chl_blk) {
		gen(chs_blk[chi_blk], 128);
		if (--chl_blk[chi_blk] === 0 && ++chi_blk === chl_blk.length)
			chs_blk = chl_blk = null;
	}
	if (chl_edge) {
		gen(chs_edge[chi_edge], chl_edge[chi_edge]);
		if (++chi_edge === chl_edge.length)
			chs_edge = chl_edge = null;
	}
	for (var i = 0; i < lst.length; ++i) {
		var ch = Array.from(lst[i][1]);
		for (var j = 0; j < ch.length; ++j) {
			var l = table[text_size(ch[j])] || ch[j];
			ch[j] = l[Math.floor(Math.random() * l.length)];
		}
		lst[i][0].innerText = ch.join("");
	}
}
frame();
